<a href="https://colab.research.google.com/github/martinkioko/firstcode101/blob/master/Pandas_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np
import pandas as pd

In [0]:
labels =['a','b','c']
mydata=[10,20,30]
arr=np.array(mydata)
d={'a':10,'b':20,'c':30}

NameError: ignored

# Series

In [0]:
pd.Series(data=mydata)

0    10
1    20
2    30
dtype: int64

In [0]:
pd.Series(data=mydata,index=labels)

a    10
b    20
c    30
dtype: int64

In [0]:
pd.Series(arr) #array

0    10
1    20
2    30
dtype: int64

In [0]:
pd.Series(d) #dict

a    10
b    20
c    30
dtype: int64

In [0]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [0]:
#USING SERIES

In [0]:
#INDEX

In [0]:
ser1=pd.Series([1,2,3,4],['Bungoma','Embu','Meru','Nairobi'])

In [0]:
ser1

Bungoma    1
Embu       2
Meru       3
Nairobi    4
dtype: int64

In [0]:
ser2=pd.Series([1,2,3,4],['Bungoma','Embu','Kiambu','Nairobi'])

In [0]:
ser2

Bungoma    1
Embu       2
Kiambu     3
Nairobi    4
dtype: int64

In [0]:
ser1['Nairobi']

4

In [0]:
ser1['Embu']

2

In [0]:
ser1+ser2

Bungoma    2.0
Embu       4.0
Kiambu     NaN
Meru       NaN
Nairobi    8.0
dtype: float64

# Dataframes

In [0]:
from numpy.random import randn
import numpy as np
import pandas as pd

In [0]:
np.random.seed(105)

In [0]:
df=pd.DataFrame(randn(5,5),['a','b','c','d','e'] ,['w','x','y','z','ab'])

In [0]:
df

          w         x         y         z        ab
a -0.245326 -0.613352 -0.726768  0.059366  1.005580
b -0.128140 -1.533992  0.470710 -0.555311 -0.204716
c  1.704763  2.573846  0.555636  0.950649 -1.405614
d  1.420322 -1.286894  0.142174  0.689817 -0.302278
e -1.575081  0.294986  0.894678 -1.730396 -0.092251

In [0]:
df['w']

a   -0.245326
b   -0.128140
c    1.704763
d    1.420322
e   -1.575081
Name: w, dtype: float64

In [0]:
type(df['w']) # dataframe bunch of series

pandas.core.series.Series

In [0]:
df['losh']=df['w']+df['y']  #add new column

In [0]:
df

          w         x         y         z        ab      losh
a -0.245326 -0.613352 -0.726768  0.059366  1.005580 -0.972094
b -0.128140 -1.533992  0.470710 -0.555311 -0.204716  0.342570
c  1.704763  2.573846  0.555636  0.950649 -1.405614  2.260399
d  1.420322 -1.286894  0.142174  0.689817 -0.302278  1.562496
e -1.575081  0.294986  0.894678 -1.730396 -0.092251 -0.680403

In [0]:
df.drop('losh',axis=1) #drop column; to drop rows, axis=0

          w         x         y         z        ab
a -0.245326 -0.613352 -0.726768  0.059366  1.005580
b -0.128140 -1.533992  0.470710 -0.555311 -0.204716
c  1.704763  2.573846  0.555636  0.950649 -1.405614
d  1.420322 -1.286894  0.142174  0.689817 -0.302278
e -1.575081  0.294986  0.894678 -1.730396 -0.092251

In [0]:
df

          w         x         y         z        ab      losh
a -0.245326 -0.613352 -0.726768  0.059366  1.005580 -0.972094
b -0.128140 -1.533992  0.470710 -0.555311 -0.204716  0.342570
c  1.704763  2.573846  0.555636  0.950649 -1.405614  2.260399
d  1.420322 -1.286894  0.142174  0.689817 -0.302278  1.562496
e -1.575081  0.294986  0.894678 -1.730396 -0.092251 -0.680403

In [0]:
df.drop('losh',axis=1,inplace=True) #drop column and delete

In [0]:
df

          w         x         y         z        ab
a -0.245326 -0.613352 -0.726768  0.059366  1.005580
b -0.128140 -1.533992  0.470710 -0.555311 -0.204716
c  1.704763  2.573846  0.555636  0.950649 -1.405614
d  1.420322 -1.286894  0.142174  0.689817 -0.302278
e -1.575081  0.294986  0.894678 -1.730396 -0.092251

In [0]:
df.drop('e') # drop  rows

          w         x         y         z        ab
a -0.245326 -0.613352 -0.726768  0.059366  1.005580
b -0.128140 -1.533992  0.470710 -0.555311 -0.204716
c  1.704763  2.573846  0.555636  0.950649 -1.405614
d  1.420322 -1.286894  0.142174  0.689817 -0.302278

In [0]:
 df.shape  # why drop 1 or 0

(5, 5)

In [0]:
df[['w','z','y']]   #select more than one column

          w         z         y
a -0.245326  0.059366 -0.726768
b -0.128140 -0.555311  0.470710
c  1.704763  0.950649  0.555636
d  1.420322  0.689817  0.142174
e -1.575081 -1.730396  0.894678

In [0]:
#Rows

In [0]:
df

          w         x         y         z        ab
a -0.245326 -0.613352 -0.726768  0.059366  1.005580
b -0.128140 -1.533992  0.470710 -0.555311 -0.204716
c  1.704763  2.573846  0.555636  0.950649 -1.405614
d  1.420322 -1.286894  0.142174  0.689817 -0.302278
e -1.575081  0.294986  0.894678 -1.730396 -0.092251

In [0]:
#selecting rows     loc & iloc ( loc>>location)

In [0]:
df.loc['c']    #loc

w     1.704763
x     2.573846
y     0.555636
z     0.950649
ab   -1.405614
Name: c, dtype: float64

In [0]:
df.iloc[2]   #iloc using index;ie c is index 2 in this case

w     1.704763
x     2.573846
y     0.555636
z     0.950649
ab   -1.405614
Name: c, dtype: float64

In [0]:
df.loc['b','y'] # select one digit

0.4707100425597271

In [0]:
 # select sudf.loc[['a','b'],['w','y']]bset

          w         y
a -0.245326 -0.726768
b -0.128140  0.470710

# conditional  selection

In [0]:
df>0

       w      x      y      z     ab
a  False  False  False   True   True
b  False  False   True  False  False
c   True   True   True   True  False
d   True  False   True   True  False
e  False   True   True  False  False

In [0]:
booldf=df>0

In [0]:
df[booldf]

          w         x         y         z       ab
a       NaN       NaN       NaN  0.059366  1.00558
b       NaN       NaN  0.470710       NaN      NaN
c  1.704763  2.573846  0.555636  0.950649      NaN
d  1.420322       NaN  0.142174  0.689817      NaN
e       NaN  0.294986  0.894678       NaN      NaN

In [0]:
df['x']>0

a    False
b    False
c     True
d    False
e     True
Name: x, dtype: bool

In [0]:
df[(df['w']>0) & (df['y']<1)]   #and (it gives results only within the parameters)

          w         x         y         z        ab
c  1.704763  2.573846  0.555636  0.950649 -1.405614
d  1.420322 -1.286894  0.142174  0.689817 -0.302278

In [0]:
df[(df['w']>0) | (df['y']<1)]   #or

          w         x         y         z        ab
a -0.245326 -0.613352 -0.726768  0.059366  1.005580
b -0.128140 -1.533992  0.470710 -0.555311 -0.204716
c  1.704763  2.573846  0.555636  0.950649 -1.405614
d  1.420322 -1.286894  0.142174  0.689817 -0.302278
e -1.575081  0.294986  0.894678 -1.730396 -0.092251

In [0]:
# add new column

In [0]:
newinf= 'Nairobi kisumu mombasa nakuru nyeri '.split()

In [0]:
newinf

['Nairobi', 'kisumu', 'mombasa', 'nakuru', 'nyeri']

In [0]:
df['hq']=newinf

In [0]:
df

          w         x         y         z        ab       hq
a -0.245326 -0.613352 -0.726768  0.059366  1.005580  Nairobi
b -0.128140 -1.533992  0.470710 -0.555311 -0.204716   kisumu
c  1.704763  2.573846  0.555636  0.950649 -1.405614  mombasa
d  1.420322 -1.286894  0.142174  0.689817 -0.302278   nakuru
e -1.575081  0.294986  0.894678 -1.730396 -0.092251    nyeri

In [0]:
#set anything as index

In [0]:
df.set_index('hq') #to set the new column as an index

                w         x         y         z        ab
hq
Nairobi -0.245326 -0.613352 -0.726768  0.059366  1.005580
kisumu  -0.128140 -1.533992  0.470710 -0.555311 -0.204716
mombasa  1.704763  2.573846  0.555636  0.950649 -1.405614
nakuru   1.420322 -1.286894  0.142174  0.689817 -0.302278
nyeri   -1.575081  0.294986  0.894678 -1.730396 -0.092251

# Missing data

In [0]:
d={'a':[1,2,np.nan],'b':[5,np.nan,np.nan],'c':[1,2,3]}

In [0]:
d

{'a': [1, 2, nan], 'b': [5, nan, nan], 'c': [1, 2, 3]}

In [0]:
df=pd.DataFrame(d)

In [0]:
df

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [0]:
df.dropna() #to deal with missing data; 1) drop all the missing data
#this  dropped all rows with missing data

     a    b  c
0  1.0  5.0  1

In [0]:
df.dropna(axis=1) #to drop the columns with missing data

   c
0  1
1  2
2  3

In [0]:
df.dropna(thresh=2) #set the no.of rows or columns you want dropped

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2

In [0]:
df.fillna(value='0') #2)replace missing data with 0

   a  b  c
0  1  5  1
1  2  0  2
2  0  0  3

In [0]:
df['a'].fillna(value=df['a'].mean()) #replace the missing datawith the mean of the col/row

0    1.0
1    2.0
2    1.5
Name: a, dtype: float64

In [0]:
df['b'].fillna(value=df['b'].mean())

0    5.0
1    5.0
2    5.0
Name: b, dtype: float64

# Groupby

In [0]:
data={'company':['Safaricom','Safaricom','KPMG','KPMG','Nation','Nation'],
      'Person':['Otieno','Kena','john','DNG','Amina','Sam'],
      'Sales':[2000,1200,3400,1240,2430,3500]}

In [0]:
data

{'Person': ['Otieno', 'Kena', 'john', 'DNG', 'Amina', 'Sam'],
 'Sales': [2000, 1200, 3400, 1240, 2430, 3500],
 'company': ['Safaricom', 'Safaricom', 'KPMG', 'KPMG', 'Nation', 'Nation']}

In [0]:
df=pd.DataFrame(data)

In [0]:
df

     company  Person  Sales
0  Safaricom  Otieno   2000
1  Safaricom    Kena   1200
2       KPMG    john   3400
3       KPMG     DNG   1240
4     Nation   Amina   2430
5     Nation     Sam   3500

In [0]:
company=df.groupby('company')

In [0]:
company.mean()

           Sales
company
KPMG        2320
Nation      2965
Safaricom   1600

In [0]:
company=df.groupby('company').mean()

In [0]:
company

           Sales
company
KPMG        2320
Nation      2965
Safaricom   1600

In [0]:
company.sum()

Sales    6885
dtype: int64

In [0]:
company=df.groupby('company').sum()

In [0]:
company

           Sales
company
KPMG        4640
Nation      5930
Safaricom   3200

In [0]:
df.groupby('company').count()

           Person  Sales
company
KPMG            2      2
Nation          2      2
Safaricom       2      2

In [0]:
df.groupby('company').min()

          Person  Sales
company
KPMG         DNG   1240
Nation     Amina   2430
Safaricom   Kena   1200

In [0]:
df.groupby('company').max()

           Person  Sales
company
KPMG         john   3400
Nation        Sam   3500
Safaricom  Otieno   2000

In [0]:
df.groupby('company').describe()

          Sales
          count    mean          std     min     25%     50%     75%     max
company
KPMG        2.0  2320.0  1527.350647  1240.0  1780.0  2320.0  2860.0  3400.0
Nation      2.0  2965.0   756.604256  2430.0  2697.5  2965.0  3232.5  3500.0
Safaricom   2.0  1600.0   565.685425  1200.0  1400.0  1600.0  1800.0  2000.0

# Merging  Joining Concatenating

In [0]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [0]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [0]:
df3 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                        
                        index=[8, 9, 10, 11])

In [0]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [0]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [0]:
df3

# Concatenation

In [0]:
pd.concat([df1,df2,df3])

     A   B   C   D
0   A0  B0  C0  D0
1   A1  B1  C1  D1
2   A2  B2  C2  D2
3   A3  B3  C3  D3
4   A4  B4  C4  D4
5   A5  B5  C5  D5
6   A6  B6  C6  D6
7   A7  B7  C7  D7
8   A4  B4  C4  D4
9   A5  B5  C5  D5
10  A6  B6  C6  D6
11  A7  B7  C7  D7

In [0]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A4   B4   C4   D4
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A5   B5   C5   D5
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A6   B6   C6   D6
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A7   B7   C7   D7

In [0]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [0]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [0]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [0]:
pd.merge(left,right,how='inner',on='key')

In [0]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [0]:
left

In [0]:
right

In [0]:
pd.merge(left, right, on=['key1', 'key2'])

# Joining

In [0]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [0]:
left #join  the on the index

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [0]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [0]:
left.join(right)

# Operations

In [0]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [0]:
df['col2'].unique()

array([444, 555, 666])

In [0]:
len(df['col2'].unique())

3

In [0]:
df['col2'].nunique()

3

In [0]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [0]:
df

In [0]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [0]:
def times2(x):
    return x*2

In [0]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [0]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [0]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [0]:
df.columns

In [0]:
df.index

In [0]:
df

In [0]:
df.sort_values('col2')

In [0]:
df.isnull()

In [0]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [0]:
df

# Data input and output

CSV
Excel
html
sql

In [0]:
pwd

'/content'

# CSV

In [0]:
df=pd.read_csv('test.csv')

AttributeError: ignored

In [0]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [0]:
#df.to_csv('example',index=False)

# Excel

In [0]:
pd.read_excel('Excel_Sample.xlsx',sheetname='Sheet1')

In [0]:
df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

# HTML

In [0]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [0]:
df[0].head()

# SQL

In [0]:
from sqlalchemy import create_engine

In [0]:
engine = create_engine('sqlite:///:memory:')

In [0]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [0]:
df.to_sql('my_comp' ,engine)

In [0]:
sql_df = pd.read_sql('my_comp',con=engine)

In [0]:
sql_df

In [0]:
df46 = pd.read_clipboard()